; domain
;Domain File

(define (domain delivery-strips)
  (:predicates 
    (truck ?t)
    (package ?p)
    (at-truck ?t ?loc)
    (at-package ?p ?loc))

  (:action drive
    :parameters (?from ?to ?t)
    :precondition (and (truck ?t) (at-truck ?t ?from))
    :effect (and (at-truck ?t ?to) (not (at-truck ?t ?from))))

  (:action load
    :parameters (?p ?loc ?t)
    :precondition (and (package ?p) (truck ?t) (at-package ?p ?loc) (at-truck ?t ?loc))
    :effect (and (not (at-package ?p ?loc)) (at-package ?p ?t)))

  (:action unload
    :parameters (?p ?loc ?t)
    :precondition (and (package ?p) (truck ?t) (at-truck ?t ?loc) (at-package ?p ?t))
    :effect (and (at-package ?p ?loc) (not (at-package ?p ?t))))
)

; problem
;Problem File

(define (problem delivery-problem)
  (:domain delivery-strips)
  (:objects changi tampines bedok truck1 package1)
  (:init
    (truck truck1)
    (package package1)
    (at-truck truck1 tampines)
    (at-package package1 bedok))
  (:goal (at-package package1 changi))
)

; plan
1. (drive tampines bedok truck1)
   deleted: (at-truck truck1 tampines)
   added: (at-truck truck1 bedok)
   goals met: 0 of 1
2. (load package1 bedok truck1)
   deleted: (at-package package1 bedok)
   added: (at-package package1 truck1)
   goals met: 0 of 1
3. (drive bedok changi truck1)
   deleted: (at-truck truck1 bedok)
   added: (at-truck truck1 changi)
   goals met: 0 of 1
4. (unload package1 changi truck1)
   deleted: (at-package package1 truck1)
   added: (at-package package1 changi)
   goals met: 1 of 1
